/* 435. 无重叠区间: https://leetcode.cn/problems/non-overlapping-intervals/ */
/* https://programmercarl.com/0435.%E6%97%A0%E9%87%8D%E5%8F%A0%E5%8C%BA%E9%97%B4.html */

#include <stdio.h>

/* ==================================================================================================== */
/* ==================================================================================================== */
/* TODO: 目标函数 */
int eraseOverlapIntervals(int** intervals, int intervalsSize, int* intervalsColSize){

}
/* ==================================================================================================== */
/* ==================================================================================================== */

/* NOTE：主函数 */
int main(int argc, const char* argv[]) {
    
    return 0;
}