/*
 * @FilePath     : /Practice_LeetCode_C/01_Programmercarl_Series/06_Stack_Queue/03_isValid/main_chong.c
 * @Author       : Chong Liu
 * @CreateDate   : 2023-09-03 10:29:02
 * @LastEditors  : Chong Liu
 * @LastEditTime : 2023-09-24 23:06:55
 * =================================================================================
 * Copyright (c) 2023 by Chong Liu, All Rights Reserved.
 * =================================================================================
 * @Description  : 20. 有效的括号：https://leetcode.cn/problems/valid-parentheses/
 * https://programmercarl.com/0020.%E6%9C%89%E6%95%88%E7%9A%84%E6%8B%AC%E5%8F%B7.html
 */
#include <stdio.h>
#include <stdbool.h>

/**********************************************************************************/
/*                                                                                */
/*                                 TARGET FUNCTION                                */
/*                                                                                */
/**********************************************************************************/
/* TODO: 目标函数 */

/* ============================================================================== */
/* ============================================================================== */

bool isValid(char * s){
    return false;
}



/**********************************************************************************/
/*                                                                                */
/*                                  MAIN FUNCTION                                 */
/*                                                                                */
/**********************************************************************************/
/**
 * @description: 主函数
 * =================================================================================
 * @param {int} argc        程序入参个数
 * @param {char} *argv[]    程序入参字符串数组
 * @return {int}            程序运行状态
 */
int main(int argc, const char *argv[]) {

    return 0;
}