/*
 * @FilePath     : \Practice_LeetCode_C\00_Basics\01_Common_Func\test\commonStackTest.cc
 * @Author       : Chong Liu
 * @CreateDate   : 2023-12-16 00:25:13
 * @LastEditors  : Chong Liu
 * @LastEditTime : 2023-12-16 00:32:15
 * =================================================================================
 * Copyright (c) 2023 by Chong Liu, All Rights Reserved.
 * =================================================================================
 * @Description  : 通用栈单元测试
 */
/* gtest 头文件 */
#include "gtest/gtest.h"
/* 测试目标头文件 */
extern "C" {
    #include "commonTypeDef.h"
    #include "commonStack.h"
}

/**********************************************************************************/
/*                                                                                */
/*                                   TEST SUITE                                   */
/*                                                                                */
/**********************************************************************************/
class TestCommonStack : public ::testing::Test {
 public:
    static void SetUpTestCase() {
        /* Code here will be called once before all tests */
    }
    void SetUp() override {
        /* Code here will be called before each test */
    }
    void TearDown() override {
        /* Code here will be called after each test */
    }
    static void TearDownTestCase() {
        /* Code here will be called once after all tests */
    }
};

/**********************************************************************************/
/*                                                                                */
/*                                 UTILITY FUNCTIONS                              */
/*                                                                                */
/**********************************************************************************/
/* ============================================================================== */
/* StackCreate */
/* ============================================================================== */
TEST_F(TestCommonStack, TestStackCreate) {
    /* TODO */
    EXPECT_EQ(0, 0);
}

/* ============================================================================== */
/* StackPush */
/* ============================================================================== */
TEST_F(TestCommonStack, TestStackPush) {
    /* TODO */
    EXPECT_EQ(0, 0);
}

/* ============================================================================== */
/* StackPop */
/* ============================================================================== */
TEST_F(TestCommonStack, TestStackPop) {
    /* TODO */
    EXPECT_EQ(0, 0);
}

/* ============================================================================== */
/* StackTop */
/* ============================================================================== */
TEST_F(TestCommonStack, TestStackTop) {
    /* TODO */
    EXPECT_EQ(0, 0);
}

/* ============================================================================== */
/* StackIsEmpty */
/* ============================================================================== */
TEST_F(TestCommonStack, TestStackIsEmpty) {
    /* TODO */
    EXPECT_EQ(0, 0);
}

/* ============================================================================== */
/* StackIsFull */
/* ============================================================================== */
TEST_F(TestCommonStack, TestStackIsFull) {
    /* TODO */
    EXPECT_EQ(0, 0);
}

/**********************************************************************************/
/*                                                                                */
/*                                HELPER FUNCTIONS                                */
/*                                                                                */
/**********************************************************************************/
/* ============================================================================== */
/* StackPrint */
/* ============================================================================== */
TEST_F(TestCommonStack, TestStackPrint) {
    /* TODO */
    EXPECT_EQ(0, 0);
}

/* ============================================================================== */
/* StackFree */
/* ============================================================================== */
TEST_F(TestCommonStack, TestStackFree) {
    /* TODO */
    EXPECT_EQ(0, 0);
}
