/*
 * @FilePath     : \Practice_LeetCode_C\01_Programmercarl_Series\10_Dynamic_Programming\02_climbStairs\main.c
 * @Author       : Chong Liu
 * @CreateDate   : 2023-08-25 00:02:34
 * @LastEditors  : Chong Liu
 * @LastEditTime : 2023-10-17 23:40:59
 * =================================================================================
 * Copyright (c) 2023 by Chong Liu, All Rights Reserved.
 * =================================================================================
 * @Description  : 70. 爬楼梯: https://leetcode.cn/problems/climbing-stairs/
 * https://programmercarl.com/0070.%E7%88%AC%E6%A5%BC%E6%A2%AF.html
 */
#include <stdio.h>

/**********************************************************************************/
/**********************************************************************************/
/***                                                                            ***/
/***                               TARGET FUNCTION                              ***/
/***                                                                            ***/
/**********************************************************************************/
/**********************************************************************************/
/* TODO: 目标函数 */
/* ============================================================================== */
/* ============================================================================== */
int climbStairs(int n) {

}

/**********************************************************************************/
/*                                                                                */
/*                                  TEST FUNCTION                                 */
/*                                                                                */
/**********************************************************************************/
/**
 * @description: Test 1
 * =================================================================================
 * @return {void}
 */
void Test1(void) {
    /* Function call (函数调用) */

    /* Expect result (期望结果) */

    /* Validate result (验证函数调用结果) */

}

/**
 * @description: Test 2
 * =================================================================================
 * @return {void}
 */
void Test2(void) {
    /* Function call (函数调用) */

    /* Expect result (期望结果) */

    /* Validate result (验证函数调用结果) */

}

/**
 * @description: Test 3
 * =================================================================================
 * @return {void}
 */
void Test3(void) {
    /* Function call (函数调用) */

    /* Expect result (期望结果) */

    /* Validate result (验证函数调用结果) */

}

/**********************************************************************************/
/*                                                                                */
/*                                  MAIN FUNCTION                                 */
/*                                                                                */
/**********************************************************************************/
/**
 * @description: Main function, entry of program.
 * =================================================================================
 * @param {int} argc        程序入参个数
 * @param {char} *argv[]    程序入参字符串数组
 * @return {int}            程序运行状态
 */
int main(int argc, const char* argv[]) {

    return 0;
}