/*
 * @FilePath     : \Practice_LeetCode_C\00_Basics\01_Common_Func\src\commonBinaryTree.c
 * @Author       : Chong Liu
 * @CreateDate   : 2023-10-22 09:30:32
 * @LastEditors  : Chong Liu
 * @LastEditTime : 2023-10-22 12:20:57
 * =================================================================================
 * Copyright (c) 2023 by Chong Liu, All Rights Reserved.
 * =================================================================================
 * @Description  : 通用二叉树源文件
 */


/**********************************************************************************/
/*                                                                                */
/*                                UTILITY FUNCTIONS                               */
/*                                                                                */
/**********************************************************************************/