/*
 * @FilePath     : \Practice_LeetCode_C\01_Programmercarl_Series\08_Backtracking\02_combinationSum3\main.c
 * @Author       : Chong Liu
 * @CreateDate   : 2023-10-05 14:47:07
 * @LastEditors  : Chong Liu
 * @LastEditTime : 2023-10-10 10:04:10
 * =================================================================================
 * Copyright (c) 2023 by Chong Liu, All Rights Reserved.
 * =================================================================================
 * @Description  : 216. 组合总和 III: https://leetcode.cn/problems/combination-sum-iii/
 */
#include <stdio.h>

/**********************************************************************************/
/**********************************************************************************/
/***                                                                            ***/
/***                               TARGET FUNCTION                              ***/
/***                                                                            ***/
/**********************************************************************************/
/**********************************************************************************/
/* TODO: 目标函数 */

/* ============================================================================== */
/* ============================================================================== */
/**
 * @description:
 * =================================================================================
 * @param {int} k
 * @param {int} n
 * @param {int} *returnSize
 * @param {int} **returnColumnSizes
 * @return {int} **ans
 */
int **combinationSum3(int k, int n, int *returnSize, int **returnColumnSizes) {

    return NULL;
}

/**********************************************************************************/
/*                                                                                */
/*                                  MAIN FUNCTION                                 */
/*                                                                                */
/**********************************************************************************/
/**
 * @description: 主函数
 * =================================================================================
 * @param {int} argc        程序入参个数
 * @param {char} *argv[]    程序入参字符串数组
 * @return {int}            程序运行状态
 */
int main(int argc, const char *argv[]) {

    return 0;
}