/* 剑指 Offer 05. 替换空格： https://leetcode.cn/problems/ti-huan-kong-ge-lcof/ */
/* https://programmercarl.com/%E5%89%91%E6%8C%87Offer05.%E6%9B%BF%E6%8D%A2%E7%A9%BA%E6%A0%BC.html */
/* https://github.com/youngyangyang04/leetcode-master/blob/master/problems/0005.%E6%9C%80%E9%95%BF%E5%9B%9E%E6%96%87%E5%AD%90%E4%B8%B2.md */

#include <stdio.h>

/* ==================================================================================================== */
/* ==================================================================================================== */
/* TODO：目标函数 */
char* replaceSpace(char* s){

    return 0;
}
/* ==================================================================================================== */
/* ==================================================================================================== */

int main(int argc, const char* argv[]) {

    return 0;
}
