/* 344.反转字符串: https://leetcode.cn/problems/reverse-string/ */
/* https://programmercarl.com/0344.%E5%8F%8D%E8%BD%AC%E5%AD%97%E7%AC%A6%E4%B8%B2.html */
/* https://github.com/youngyangyang04/leetcode-master/blob/master/problems/0078.%E5%AD%90%E9%9B%86.md */

#include <stdio.h>

/* ==================================================================================================== */
/* ==================================================================================================== */
/* TODO：目标函数 */
void reverseString(char* s, int sSize){

    return;
}
/* ==================================================================================================== */
/* ==================================================================================================== */

int main(int argc, const char* argv[]) {

    return 0;
}